app/controllers/auth_controller.rb

	def login
		data = JSON.parse(request.body.read)
		user = User.where("username = ? AND password = ?", data["username"], data["password"]).first
---
SELECT "users".* FROM "users" WHERE (username = 'paulo' AND password = 'paulo') ORDER BY "users"."id" ASC LIMIT 1