app/controllers/emails_controller.rb

SELECT "newsletters".* FROM "newsletters" WHERE (18) ORDER BY "newsletters"."id" ASC LIMIT 1
SELECT "mailinglists".* FROM "mailinglists" WHERE "mailinglists"."id" = 8 ORDER BY "mailinglists"."id" ASC LIMIT 1
---
	def post
		data = JSON.parse(request.body.read)
		newsletter = Newsletter.where(data['newsletter']).first
		emails = Mailinglist.where(id: params[:id])