app/controllers/mailinglists_controller.rb

INSERT INTO "mailinglists" ("addresses", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["addresses", "teste"], ["created_at", Sat, 02 May 2015 15:27:12 UTC +00:00], ["name", "teste"], ["updated_at", Sat, 02 May 2015 15:27:12 UTC +00:00]]
---
	def new
		data = JSON.parse(request.body.read)
		mailinglist = Mailinglist.new(:name => data['name'], :addresses => data['addresses'])
		mailinglist.save