app/controllers/mailinglists_controller.rb

	def get
		render json: Mailinglist.where(id: params[:id]).first
---
SELECT "mailinglists".* FROM "mailinglists" WHERE "mailinglists"."id" = 8 ORDER BY "mailinglists"."id" ASC LIMIT 1