app/controllers/mailinglists_controller.rb

SELECT "mailinglists".* FROM "mailinglists"
---
	def show
		render json: Mailinglist.all

SELECT "mailinglists".* FROM "mailinglists" WHERE "mailinglists"."id" IS NULL ORDER BY "mailinglists"."id" ASC LIMIT 1
INSERT INTO "mailinglists" ("addresses", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["addresses", "asd"], ["created_at", Mon, 04 May 2015 20:49:12 UTC +00:00], ["name", "asd"], ["updated_at", Mon, 04 May 2015 20:49:12 UTC +00:00]]
UPDATE "mailinglists" SET "name" = ?, "addresses" = ?, "updated_at" = ? WHERE "mailinglists"."id" = 8  [["name", "Desporto"], ["addresses", "paulorsr@gmail.com"], ["updated_at", Mon, 04 May 2015 22:54:50 UTC +00:00]]
---
	def save
		data = JSON.parse(request.body.read)
		mailinglist = Mailinglist.where(id: params[:id]).first
		if mailinglist.present?
			mailinglist.name = data['name']
			mailinglist.addresses = data['addresses']
		else
			mailinglist = Mailinglist.new(:name => data['name'], :addresses => data['addresses'])
		end
		mailinglist.save

SELECT "mailinglists".* FROM "mailinglists" WHERE "mailinglists"."id" = 1 ORDER BY "mailinglists"."id" ASC LIMIT 1
---
	def edit
		render json: Mailinglist.where(id: params[:id]).first

SELECT "mailinglists".* FROM "mailinglists" WHERE "mailinglists"."id" = 1 ORDER BY "mailinglists"."id" ASC LIMIT 1
DELETE FROM "mailinglists" WHERE "mailinglists"."id" = ?  [["id", 1]]
SELECT "mailinglists".* FROM "mailinglists"
---
	def delete
		mailinglist = Mailinglist.where(id: params[:id]).first
		mailinglist.destroy
		render json: Mailinglist.all