app/controllers/newsletters_controller.rb

	def new
		data = JSON.parse(request.body.read)
		newsletter = Newsletter.new(:name => data['name'], :content => data['content'])
		newsletter.save
---
INSERT INTO "newsletters" ("content", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["content", "<html><h1>Tudo sobre politica</h1></html>"], ["created_at", Sat, 02 May 2015 14:40:30 UTC +00:00], ["name", "Politica"], ["updated_at", Sat, 02 May 2015 14:40:30 UTC +00:00]]

	def edit
		render json: Newsletter.where(id: params[:id]).first
---
SELECT "newsletters".* FROM "newsletters" WHERE "newsletters"."id" = 1 ORDER BY "newsletters"."id" ASC LIMIT 1