app/controllers/newsletters_controller.rb

	def show
		render json: Newsletter.all
---
SELECT "newsletters".* FROM "newsletters"

	def get
		render json: Newsletter.where(id: params[:id]).first
---
SELECT "newsletters".* FROM "newsletters" WHERE "newsletters"."id" = 17 ORDER BY "newsletters"."id" ASC LIMIT 1

	def save
		data = JSON.parse(request.body.read)
		newsletter = Newsletter.where(id: params[:id]).first
		if newsletter.present?
			newsletter.name = data['name']
			newsletter.content = data['content']
		else
			newsletter = Newsletter.new(:name => data['name'], :content => data['content'])
		end
		newsletter.save
---
SELECT "newsletters".* FROM "newsletters" WHERE "newsletters"."id" IS NULL ORDER BY "newsletters"."id" ASC LIMIT 1
INSERT INTO "newsletters" ("content", "created_at", "name", "updated_at") VALUES (?, ?, ?, ?)  [["content", "teste"], ["created_at", Mon, 04 May 2015 20:40:40 UTC +00:00], ["name", "teste"], ["updated_at", Mon, 04 May 2015 20:40:40 UTC +00:00]]
UPDATE "newsletters" SET "name" = ?, "content" = ?, "updated_at" = ? WHERE "newsletters"."id" = 18  [["name", "Desporto"], ["content", "<html>Teste</html>"], ["updated_at", Mon, 04 May 2015 22:54:35 UTC +00:00]]

	def delete
		newsletter = Newsletter.where(id: params[:id]).first
		newsletter.destroy
		render json: Newsletter.all
---
SELECT "newsletters".* FROM "newsletters" WHERE "newsletters"."id" = 3 ORDER BY "newsletters"."id" ASC LIMIT 1
DELETE FROM "newsletters" WHERE "newsletters"."id" = ?  [["id", 3]]
SELECT "newsletters".* FROM "newsletters"